{"class_name": "Model", "keras_version": "2.2.4", "config": {"input_layers": [["input_1", 0, 0]], "name": "model_1", "layers": [{"class_name": "InputLayer", "inbound_nodes": [], "name": "input_1", "config": {"batch_input_shape": [null, 13], "name": "input_1", "sparse": false, "dtype": "float32"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "first_bn", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "trainable": true, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "first_bn", "scale": true, "gamma_constraint": null, "momentum": 0.99, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Dense", "inbound_nodes": [[["first_bn", 0, 0, {}]]], "name": "dense1", "config": {"activation": "linear", "name": "dense1", "bias_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 5}}, {"class_name": "CustomActivation", "inbound_nodes": [[["dense1", 0, 0, {}]]], "name": "custom_activation_1", "config": {"name": "custom_activation_1", "trainable": true}}, {"class_name": "Dropout", "inbound_nodes": [[["custom_activation_1", 0, 0, {}]]], "name": "dropout1", "config": {"seed": null, "name": "dropout1", "rate": 0.2, "trainable": true, "noise_shape": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["dropout1", 0, 0, {}]]], "name": "bn1", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "trainable": true, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "bn1", "scale": true, "gamma_constraint": null, "momentum": 0.99, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Dense", "inbound_nodes": [[["bn1", 0, 0, {}]]], "name": "dense2", "config": {"activation": "linear", "name": "dense2", "bias_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 5}}, {"class_name": "CustomActivation", "inbound_nodes": [[["dense2", 0, 0, {}]]], "name": "custom_activation_2", "config": {"name": "custom_activation_2", "trainable": true}}, {"class_name": "Dropout", "inbound_nodes": [[["custom_activation_2", 0, 0, {}]]], "name": "dropout_1", "config": {"seed": null, "name": "dropout_1", "rate": 0.2, "trainable": true, "noise_shape": null}}, {"class_name": "Concatenate", "inbound_nodes": [[["dropout1", 0, 0, {}], ["dropout_1", 0, 0, {}]]], "name": "concatenate_1", "config": {"name": "concatenate_1", "trainable": true, "axis": -1}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "name": "bn2", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "trainable": true, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "bn2", "scale": true, "gamma_constraint": null, "momentum": 0.99, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Dense", "inbound_nodes": [[["bn2", 0, 0, {}]]], "name": "dense3", "config": {"activation": "linear", "name": "dense3", "bias_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 5}}, {"class_name": "CustomActivation", "inbound_nodes": [[["dense3", 0, 0, {}]]], "name": "custom_activation_3", "config": {"name": "custom_activation_3", "trainable": true}}, {"class_name": "Dropout", "inbound_nodes": [[["custom_activation_3", 0, 0, {}]]], "name": "dropout_2", "config": {"seed": null, "name": "dropout_2", "rate": 0.2, "trainable": true, "noise_shape": null}}, {"class_name": "Concatenate", "inbound_nodes": [[["dropout_2", 0, 0, {}], ["dropout_1", 0, 0, {}]]], "name": "concatenate_2", "config": {"name": "concatenate_2", "trainable": true, "axis": -1}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["concatenate_2", 0, 0, {}]]], "name": "batch_normalization_1", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "trainable": true, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_1", "scale": true, "gamma_constraint": null, "momentum": 0.99, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Dense", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "name": "dense4", "config": {"activation": "relu", "name": "dense4", "bias_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1}}], "output_layers": [["dense4", 0, 0]]}, "backend": "tensorflow"}