{"class_name": "Model", "config": {"name": "model_1", "layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, 943], "sparse": false, "name": "input_1"}, "name": "input_1"}, {"class_name": "Dense", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "activation": "tanh", "use_bias": true, "name": "dense_1", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 3000, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "trainable": true}, "name": "dense_1"}, {"class_name": "Dropout", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "config": {"rate": 0.1, "name": "dropout_1", "seed": null, "noise_shape": null, "trainable": true}, "name": "dropout_1"}, {"class_name": "Dense", "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "config": {"bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "activation": "linear", "use_bias": true, "name": "dense_2", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 4760, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "trainable": true}, "name": "dense_2"}], "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_2", 0, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow"}